## 연산

In [7]:
import pandas as pd
st1 = pd.Series({'국어':100, '영어':80, '수학':90})
st2 = pd.Series({'수학':80, '국어': 90, '영어':80})

print(st1, '\n')
print(st2)

국어    100
영어     80
수학     90
dtype: int64

수학    80
국어    90
영어    80
dtype: int64

In [6]:
# 시리즈끼리 연산 - 인덱스가 같은 것 끼리 더해짐. 
add = st1 + st2 
sub = st1 - st2
mul = st1 * st2
div = round((st1 / st2),2)  #소수점 두자리만 출력
print(add, '\n')
print(sub, '\n')
print(mul, '\n')
print(div, '\n')

국어    190
수학    170
영어    160
dtype: int64

국어    10
수학    10
영어     0
dtype: int64

국어    9000
수학    7200
영어    6400
dtype: int64

국어    1.11
수학    1.12
영어    1.00
dtype: float64

In [8]:
df = pd.concat([add,sub,mul,div], axis=1)
df

      0   1     2     3
국어  190  10  9000  1.11
수학  170  10  7200  1.12
영어  160   0  6400  1.00

In [9]:
# Q. df의 컬럼 이름을 add, sub, mul, div으로 변경하여 출력하세요.
# df.rename(columns={0:'add',1:'sub',2:'mul',3:'div'}, inplace=True)
df.columns = ['add','sub','mul','div']
df

    add  sub   mul   div
국어  190   10  9000  1.11
수학  170   10  7200  1.12
영어  160    0  6400  1.00

In [12]:
import numpy as np
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd')) #데이터프레임이라 괄호가 두개
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [13]:
a = np.arange(12)
print(a)
a.reshape(2,2,3)  #1차원을 n차원으로 바꿀 때 reshape(4,3)도 됨

[ 0  1  2  3  4  5  6  7  8  9 10 11]

array([[[ 0,  1,  2],
        [ 3,  4,  5]],

       [[ 6,  7,  8],
        [ 9, 10, 11]]])

In [14]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [15]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [18]:
add_data = df1.add(df2, fill_value=0)
add_data

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [32]:
print(df1 + df2, '\n')
print(df1 - df2, '\n')
print(df1 * df2, '\n')
print(df1 / df2, '\n')

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0 -1.0 -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

      a     b      c      d   e
0   0.0   1.0    4.0    9.0 NaN
1  20.0  30.0   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

     a         b         c         d   e
0  NaN  1.000000  1.000000  1.000000 NaN
1  0.8  0.833333  0.857143  0.875000 NaN
2  0.8  0.818182  0.833333  0.846154 NaN
3  NaN       NaN       NaN       NaN NaN

In [34]:
1/df1
# df1.rdiv(1) 둘이 같은 뜻 (역수로 나눠주는 것)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [42]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [46]:
# df1을 시리즈로 뽑기
print(df1)
s1 = df1.iloc[0]
s1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

a    0.0
b    1.0
c    2.0
d    3.0
Name: 0, dtype: float64

In [47]:
df1 -s1

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  4.0  4.0  4.0  4.0
2  8.0  8.0  8.0  8.0

In [49]:
s2 = df1['d']
s2

0     3.0
1     7.0
2    11.0
Name: d, dtype: float64

In [52]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [51]:
df1.sub(s2,axis=0)

     a    b    c    d
0 -3.0 -2.0 -1.0  0.0
1 -3.0 -2.0 -1.0  0.0
2 -3.0 -2.0 -1.0  0.0

In [53]:
df1.sub(s1, axis=1)

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  4.0  4.0  4.0  4.0
2  8.0  8.0  8.0  8.0

In [ ]:
# 과제 : 데이터프레임 df1,df2를 생성하고 첫번째 행을 r1,r2에 
# 첫번째 열을 c1,c2에 저장한 후 다음 연산을 수행하세요.
- df1 + df2
- df1 - r1
- df1 -c1

In [ ]:
# rdiv() :역수로 나누는 것
# 덧셈, 곱셈, 뺄셈 경우도 함수를 찾아 연산 수행 해보기